$(function() {
	
	// 設定頁籤
	//lotteryGameBetControllercqssc.setGameTypeTab(1);
	
	// 倍數&模式綁定事件
	//$("#bet_multi").change(lotteryGameBetControllercqssc.betContentOnChange);
	//$("#bet_mode").change(lotteryGameBetControllercqssc.betContentOnChange);
	//$("#operate-result input[type=radio]").click(lotteryGameBetControllercqssc.betContentOnChange);
	
	// 顯示購物車紀錄及下注紀錄
	//lotteryGameCartControll.showCartData();
});

// 切換頁籤啟用
//lotteryGameBetControllercqssc.spTabBtn = false;

// 玩法頁籤配置
lotteryGameBetControllercqssc.gameTypeTabConfig = {
		1 : "五星",
		2 : "四星",
		3 : "后三",
		4 : "中三",
		5 : "前三",
		6 : "二星",
		7 : "定位胆",
		8 : "不定位",
		9 : "大小单双",
		10 : "任选",
		11 : "龙虎",
		12 : "棋牌"
};
	
// 玩法區域配置
lotteryGameBetControllercqssc.gameTypeConfig = {
		1 : {
				'五星直' : {
						1 : '直选复式', 
						2 : '直选单式', 
						3 : '五星组合',
				},
				'五星' : {
						4 : '组选120', 
						5 : '组选60', 
						6 : '组选30', 
						7 : '组选20', 
						8 : '组选10', 
						9 : '组选5'
				},
				'五星' : {
						10 : '一帆风顺',
						11 : '好事成双',
						12 : '三星报喜',
						13 : '四季发财'
				}
		},
		2 : {
				'后四' : {
						14 : '直选复式', 
						15 : '直选单式', 
						16 : '四星组合'
				},
				'后四' : {
						17 : '组选24', 
						18 : '组选12', 
						19 : '组选6', 
						20 : '组选4'
				},
				'前四' : {
						99 : '直选复式', 
						100 : '直选单式', 
						101 : '四星组合'
				},
				'前四' : {
						102 : '组选24', 
						103 : '组选12', 
						104 : '组选6', 
						105 : '组选4'
				}
		},
		3 : {
				'后三' : {
						21 : '直选复式', 
						22 : '直选单式', 
						23 : '后三组合',
						24 : '直选和值',
						25 : '直选跨度'
				},
				'后三' : {
						26 : '组三复式', 
						27 : '组三单式', 
						28 : '组六复式', 
						29 : '组六单式', 
						30 : '混合组选', 
						31 : '组选和值',
						32 : '组选包胆'
				},
				'后三' : {
						33 : '和值尾数', 
						34 : '特殊号'
				}
		},
		4 : {
				'中三' : {
						106 : '直选复式', 
						107 : '直选单式', 
						108 : '中三组合',
						109 : '直选和值',
						110 : '直选跨度'
				},
				'中三' : {
						111 : '组三复式', 
						112 : '组三单式', 
						113 : '组六复式', 
						114 : '组六单式', 
						115 : '混合组选', 
						116 : '组选和值',
						117 : '组选包胆'
				},
				'中三' : {
						118 : '和值尾数', 
						119 : '特殊号'
				}
		},
		5 : {
				'前三' : {
						35 : '直选复式', 
						36 : '直选单式', 
						37 : '前三组合',
						38 : '直选和值',
						39 : '直选跨度'
				},
				'前三' : {
						40 : '组三复式', 
						41 : '组三单式', 
						42 : '组六复式', 
						43 : '组六单式', 
						44 : '混合组选', 
						45 : '组选和值',
						46 : '组选包胆'
				},
				'前三' : {
						47 : '和值尾数', 
						48 : '特殊号'
				}
		},
		6 : {
				'后二' : {
						49 : '直选复式',
						50 : '直选单式',
						51 : '直选和值',
						52 : '直选跨度'
				},
				'后二' : {
						53 : '组选复式',
						54 : '组选单式',
						55 : '组选和值',
						56 : '组选包胆'
				},
				'前二' : {
						57 : '直选复式',
						58 : '直选单式',
						59 : '直选和值',
						60 : '直选跨度'
				},
				'前二' : {
						61 : '组选复式',
						62 : '组选单式',
						63 : '组选和值',
						64 : '组选包胆'
				}
		},
		7 : {
				'定位胆' : {
						65 : '定位胆'
				}
		},
		8 : {
				'三星' : {
						66 : '后三一码',
						67 : '前三一码',
						68 : '后三二码',
						69 : '前三二码'
				},
				'四星' : {
						70 : '四星一码',
						71 : '四星二码'
				},
				'五星' : {
						72 : '五星二码',
						73 : '五星三码'
				}
		},
		9 : {
				'大小单双' : {
						74 : '前二大小单双',
						75 : '后二大小单双',
						76 : '前三大小单双',
						77 : '后三大小单双',
						144 : '总和大小单双'
				}
		},
		10 : {
				'任二直选' : {
						78 : '直选复式',
						79 : '直选单式',
						80 : '直选和值'
				},
				'任二组选' : {
						81 : '组选复式',
						82 : '组选单式',
						83 : '组选和值'
				},
				'任三直选' : {
						84 : '直选复式',
						85 : '直选单式',
						86 : '直选和值'
				},
				'任三组选' : {
						87 : '组三复式',
						88 : '组三单式',
						89 : '组六复式',
						90 : '组六单式',
						91 : '混合组选',
						92 : '组选和值'
				},
				'任四直选' : {
						93 : '直选复式',
						94 : '直选单式'
				},
				'任四组选' : {
						95 : '组选24',
						96 : '组选12',
						97 : '组选6',
						98 : '组选4'
				}
		},
		11 : {
				'龙虎' : {
						120 : '万千',
						121 : '万百',
						122 : '万十',
						123 : '万个',
						124 : '千百',			
				},
				'龙虎' : {
						125 : '千十',
						126 : '千个',
						127 : '百十',
						128 : '百个',
						129 : '十个'
				}
		},
		12 : {
				'百家乐' : {
						131 : '庄闲和',
						132 : '庄闲对',
						133 : '庄闲大小单双质合'
				},
				'斗牛' : {
						134 : '牛牛',
						135 : '大小单双'
				},
				'德州扑克' : {
						136 : '德州扑克'
				},
				'三公' : {
						137 : '左右和',
						138 : '大小单双质合'
				}
		}
};

// 隨機下注方法
lotteryGameBetControllercqssc.betRandMethod = {
		1 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 1,
					// 下注設定 行數
					"array_length" : 5,
					// 下注設定 單行內容個數
					"num_length" : 1,
					// 下注數字最低位數
					"digi_len" : 1,
					// 下注數字可否重複
					"num_double" : true,
					// 下注單數
					"amount" : rand_bet_amount
			}
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetData(rand_config);
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		14 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 14,
					// 下注設定 行數
					"array_length" : 4,
					// 下注設定 單行內容個數
					"num_length" : 1,
					// 下注數字最低位數
					"digi_len" : 1,
					// 下注數字可否重複
					"num_double" : true,
					// 下注單數
					"amount" : rand_bet_amount
			}
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetData(rand_config);
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		21 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 21,
					// 下注設定 行數
					"array_length" : 3,
					// 下注設定 單行內容個數
					"num_length" : 1,
					// 下注數字最低位數
					"digi_len" : 1,
					// 下注數字可否重複
					"num_double" : true,
					// 下注單數
					"amount" : rand_bet_amount
			}
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetData(rand_config);
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		35 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 35,
					// 下注設定 行數
					"array_length" : 3,
					// 下注設定 單行內容個數
					"num_length" : 1,
					// 下注數字最低位數
					"digi_len" : 1,
					// 下注數字可否重複
					"num_double" : true,
					// 下注單數
					"amount" : rand_bet_amount
			}
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetData(rand_config);
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		49 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 49,
					// 下注設定 行數
					"array_length" : 2,
					// 下注設定 單行內容個數
					"num_length" : 1,
					// 下注數字最低位數
					"digi_len" : 1,
					// 下注數字可否重複
					"num_double" : true,
					// 下注單數
					"amount" : rand_bet_amount
			}
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetData(rand_config);
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		57 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 57,
					// 下注設定 行數
					"array_length" : 2,
					// 下注設定 單行內容個數
					"num_length" : 1,
					// 下注數字最低位數
					"digi_len" : 1,
					// 下注數字可否重複
					"num_double" : true,
					// 下注單數
					"amount" : rand_bet_amount
			}
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetData(rand_config);
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		65 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 65,
					// 最低下注號碼
					"min_bet_num" : 1,
					// 總行數
					"rand_bet_rows" : 5,
					// 下注單數
					"amount" : rand_bet_amount
			}
			
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetDataCustomRows(rand_config);
			
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		66 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 66,
					// 下注設定 行數
					"array_length" : 1,
					// 下注設定 單行內容個數
					"num_length" : 1,
					// 下注數字最低位數
					"digi_len" : 1,
					// 下注數字可否重複
					"num_double" : true,
					// 下注單數
					"amount" : rand_bet_amount
			}
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetData(rand_config);
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		78 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 78,
					// 最低下注號碼
					"min_bet_num" : 2,
					// 總行數
					"rand_bet_rows" : 5,
					// 下注單數
					"amount" : rand_bet_amount
			}
			
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetDataCustomRows(rand_config);
			
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		84 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 84,
					// 最低下注號碼
					"min_bet_num" : 3,
					// 總行數
					"rand_bet_rows" : 5,
					// 下注單數
					"amount" : rand_bet_amount
			}
			
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetDataCustomRows(rand_config);
			
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		},
		93 : function(rand_bet_amount) {
			
			// 隨機玩法設定
			var rand_config = {
					// 下注設定 玩法ID
					"game_type_id" : 93,
					// 最低下注號碼
					"min_bet_num" : 4,
					// 總行數
					"rand_bet_rows" : 5,
					// 下注單數
					"amount" : rand_bet_amount
			}
			
			// 取得隨機注單
			var rand_bet_array = lotteryGameBetControllercqssc.getRandBetDataCustomRows(rand_config);
			
			// 加入購物車
			$.each(rand_bet_array, function (key, value) {
				lotteryGameBetControllercqssc.betAddBetToCart(rand_config.game_type_id, JSON.stringify(value));
			});
		}
};
	
// 下注區域配置
lotteryGameBetControllercqssc.gameTypeBetConfig = {
		// 五星_直选复式
		// 1
		1 : {
				title : '从万位、千位、百位、十位、个位各选一个号码组成一注。',
				help : '从万位、千位、百位、十位、个位各选一个号码组成一注。',
				how : '从万位、千位、百位、十位、个位中选择一个5位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖',
				sample : '12345',
				reward : '12345，即中五星直选。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_直选单式
		// 2
		2 : {
				title : '手动输入号码，至少输入1个五位数号码组成一注。',
				help : '手动输入号码，至少输入1个五位数号码组成一注。',
				how : '手动输入一个5位数号码组成一注，所选号码的万位、千位、百位、十位、个位与开奖号码相同，且顺序一致，即为中奖',
				sample : '23456',
				reward : '23456，即中五星直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 五星_五星组合
		// 3
		3 : {
				title : '从万位、千位、百位、十位、个位各选一个号码组成五注。',
				help : '从万位、千位、百位、十位、个位各选一个号码组成五注。', 
				how :'从万位、千位、百位、十位、个位中至少选择一个号码，组成1-5星的组合，共五注，所选号码的个位与开奖号码对应位相同，则中1个5等奖 ;所选号码的个位、十位与开奖号码对应位相同，则中1个5等奖以及1个4等奖，依此类推，最高可中5个奖。',
				sample : '4+5+6+7+8，该票共10元，由以下5注：45678（五星）、5678（四星）、678（三星）、78（二星）、8（一星）构成',
				reward : '45678，即中五星、四星、三星、二星、一星各1注。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
		            '五星' : '取得中',
		            '四星' : '取得中',
		            '三星' : '取得中',
		            '二星' : '取得中',
		            '一星' : '取得中'
		        }
		},
		// 五星_五星和值
		// 130
		130 : {
				title : '从0-45中任意选择1个或1个以上号码。',
				help : '从0-45中任意选择1个或1个以上号码。', 
				how :'00001、00010、00100、01000、10000，即为中五星和值。',
				sample : '和值1',
				reward : '00001、00010、00100、01000、10000，即为中五星和值。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26','27'],
								['28','29','30','31','32','33','34','35','36','37','38','39','40','41'],
								['42','43','44','45']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_组选120
		// 4
		4 : {
				title : '从0-9中选择5个号码组成一注。',
				help : '从0-9中选择5个号码组成一注。', 
				how :'从0-9中任意选择5个号码组成一注，所选号码与开奖号码的万位、千位、百位、十位、个位相同，且顺序不限，即为中奖。',
				sample : '10568',
				reward : '10568〈顺序不限〉，即可中五星组选120。' ,
				betType : 'btn_line',
				betBtn : {
						'组选120' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_组选60
		// 5
		5 : {
				title : '从“二重号”选择一个号码、“单号”选择三个号码组成一注。',
				help : '从“二重号”选择一个号码、“单号”选择三个号码组成一注。', 
				how :'选择1个二重号码和3个单号号码组成一注，所选的单号号码与开奖号码相同，且所选二重号码在开奖号码中出现2次，即为中奖。',
				sample : '二重号8、单号016',
				reward : '01688（顺序不限〉，即可中五星组选60。' ,
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_组选30
		// 6
		6 : {
				title : '从“二重号”选择两个号码、“单号”选择一个号码组成一注。',
				help : '从“二重号”选择两个号码、“单号”选择一个号码组成一注。', 
				how :'选择2个二重号和1个单号号码组成一注，所选的单号号码与开奖号码相同，且所选的2个二重号码分别在开奖号码中出现了2次，即为中奖。',
				sample : '二重号68、单号0',
				reward : '06688（顺序不限〉，即可中五星组选30。' ,
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_组选20
		// 7
		7 : {
				title : '从“三重号”选择一个号码、“单号”选择两个号码组成一注。',
				help : '从“三重号”选择一个号码、“单号”选择两个号码组成一注。', 
				how :'选择1个三重号码和2个单号号码组成一注，所选的单号号码与开奖号码相同，且所选三重号码在开奖号码中出现3次，即为中奖。',
				sample : '三重号8、单号01',
				reward : '01888（顺序不限），即可中五星组选20。' ,
				betType : 'btn_line',
				betBtn : {
						'三重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_组选10
		// 8
		8 : {
				title : '从“三重号”选择一个号码，“二重号”中选择一个号码组成一注',
				help : '选择1个三重号码和1个二重号码，所选三重号码在开奖号码中出现3次，并且所选二重号码在开奖号码中出现了2次，即为中奖。',
				how : '选择1个三重号码和1个二重号码，所选三重号码在开奖号码中出现3次，并且所选二重号码在开奖号码中出现了2次，即为中奖。',
				sample : '三重号8、二重号1',
				reward : '11888〈顺序不限〉，即可中五星组选10。' ,
				betType : 'btn_line',
				betBtn : {
						'三重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_组选5
		// 9
		9 : {
				title : '从“四重号”选择一个号码、“单号”中选择一个号码组成一注。',
				help : '从“四重号”选择一个号码、“单号”中选择一个号码组成一注。',
				how : '选择1个四重号码和1个单号号码组成一注，所选的单号号码与开奖号码相同，且所选四重号码在开奖号码中出现了4次，即为中奖。',
				sample : '四重号8、单号1',
				reward : '18888（顺序不限），即可中五星组选5。' ,
				betType : 'btn_line',
				betBtn : {
						'四重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_一帆风顺
		// 10
		10 : {
				title : '从0-9中任意选择1个以上号码。',
				help : '从0-9中任意选择1个以上号码。',
				how :'从0-9中任意选择1个号码组成一注，只要开奖号码的万位、千位、百位、十位、个位中包含所选号码，即为中奖。',
				sample : '8',
				reward : '至少出现1个8，即中一帆风顺。' ,
				betType : 'btn_line',
				betBtn : {
						'一帆风顺' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_好事成双
		// 11
		11 : {
				title : '从0-9中任意选择1个以上的二重号码。',
				help : '从0-9中任意选择1个以上的二重号码。',
				how :'从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现2次，即为中奖。',
				sample : '8',
				reward : '至少出现2个8，即中好事成双。' ,
				betType : 'btn_line',
				betBtn : {
						'好事成双' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_三星报喜
		// 12
		12 : {
				title : '从0-9中任意选择1个以上的三重号码。',
				help : '从0-9中任意选择1个以上的三重号码。',
				how :'从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现3次，即为中奖。',
				sample : '3',
				reward : '至少出现3个3，即中三星报喜。' ,
				betType : 'btn_line',
				betBtn : {
						'三星报喜' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_四季发财
		// 13
		13 : {
				title : '从0-9中任意选择1个以上的四重号码。',
				help : '从0-9中任意选择1个以上的四重号码。',
				how :'从0-9中任意选择1个号码组成一注，只要所选号码在开奖号码的万位、千位、百位、十位、个位中出现4次，即为中奖。',
				sample : '8',
				reward : '至少出现4个8，即中四季发财。' ,
				betType : 'btn_line',
				betBtn : {
						'四季发财' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 四星_直选复式
		// 14
		14 : {
				title : '从千位、百位、十位、个位各选一个号码组成一注。',
				help : '从千位、百位、十位、个位各选一个号码组成一注。', 
				how :'从千位、百位、十位、个位中选择一个4位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。',
				sample : '3456',
				reward : '3456，即中四星直选。' ,
				betType : 'btn_line',
				betBtn : {
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 四星_直选单式
		// 15
		15 : {
				title : '手动输入号码，至少输入1个四位数号码组成一注。',	
				help : '手动输入号码，至少输入1个四位数号码组成一注。',
				how :'手动输入一个4位数号码组成一注，所选号码的千位、百位、十位、个位与开奖号码相同，且顺序一致，即为中奖。',
				sample : '3456',
				reward : '3456，即中四星直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 四星_四星组合
		// 16
		16 : {
				title : '从千位、百位、十位、个位各选一个号码组成四注。',
				help : '从千位、百位、十位、个位各选一个号码组成四注。',
				how :'从千位、百位、十位、个位中至少选择一个号码，组成1-4星的组合，共四注，所选号码的个位与开奖号码对应位相同，则中1个4等奖 ;所选号码的个位、十位与开奖号码对应位相同，则中1个4等奖以及1个3等奖，依此类推，最高可中4个奖。',
				sample : '5+6+7+8，该票共8元，由以下4注：5678（四星）、678（三星）、78（二星）、8（一星）构成',
				reward : '后四位为5678，即中四星、三星、二星、一星各1注。' ,
				betType : 'btn_line',
				betBtn : {
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '四星' : '取得中',
			            '三星' : '取得中',
			            '二星' : '取得中',
			            '一星' : '取得中'
		        }
		},
		// 四星_组选24
		// 17
		17 : {
				title : '从0-9中选择4个号码组成一注。',
				help : '从0-9中选择4个号码组成一注。',
				how :'从0-9中任意选择4个号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且顺序不限，即为中奖。',
				sample : '0568',
				reward : '*0568（顺序不限），即可中四星组选24。' ,
				betType : 'btn_line',
				betBtn : {
						'组选24' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 四星_组选12
		// 18
		18 : {
				title : '从“二重号”选择一个号码、“单号”选择两个号码组成一注。',
				help : '从“二重号”选择一个号码、“单号”选择两个号码组成一注。',
				how :'选择1个二重号和2个单号号码组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且所选的1个二重号码分别在开奖号码中出现2次，以及所选的2个单号出现，即为中奖。',
				sample : '二重号8、单号06',
				reward : '*0688（顺序不限），即可中四星组选12。' ,
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 四星_组选6
		// 19
		19 : {
				title : '从“二重号”选择两个号码组成一注。',
				help : '从“二重号”选择两个号码组成一注。',
				how :'选择2个二重号码组成一注，所选的2个二重号码在开奖号码的千位、百位、十位、个位中分别出现了2次，即为中奖。',
				sample : '二重号28',
				reward : '*2288（顺序不限），即可中四星组选6。' ,
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 四星_组选4
		// 20
		20 : {
				title : '从“三重号”选择一个号码、“单号”选择一个号码组成一注。',
				help : '从“三重号”选择一个号码、“单号”选择一个号码组成一注。',
				how :'选择1个三重号码和1个单号组成一注，所选号码与开奖号码的千位、百位、十位、个位相同，且所选三重号码在开奖号码中出现3次，即为中奖。',
				sample : '三重号8、单号2',
				reward : '*8828（顺序不限），即可中四星组选4。' ,
				betType : 'btn_line',
				betBtn : {
						'三重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前四_直选复式
		// 99
		99 : {
				title : '从万位、千位、百位、十位各选一个号码组成一注。',
				help : '从万位、千位、百位、十位各选一个号码组成一注。',
				how :'从万位、千位、百位、十位中选择一个4位数号码组成一注，所选号码与开奖号码相同，且顺序一致，即为中奖。',
				sample : '3456',
				reward : '3456，即中四星直选。' ,
				betType : 'btn_line',
				betBtn : {
					
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前四_直选单式
		// 100
		100 : {
				title : '手动输入号码，至少输入1个四位数号码组成一注。',
				help : '手动输入号码，至少输入1个四位数号码组成一注。',
				how :'手动输入一个4位数号码组成一注，所选号码的万位、千位、百位、十位与开奖号码相同，且顺序一致，即为中奖。',
				sample : '3456',
				reward : '3456，即中四星直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 前四_四星组合
		// 101
		101 : {
				title : '从万位、千位、百位、十位各选一个号码组成四注。',
				help : '从万位、千位、百位、十位各选一个号码组成四注。', 
				how :'从万位、千位、百位、十位中至少选择一个号码，组成1-4星的组合，共四注，所选号码的十位与开奖号码对应位相同，则中1个4等奖 ;所选号码的十位、百位与开奖号码对应位相同，则中1个4等奖以及1个3等奖，依此类推，最高可中4个奖。',
				sample : '5+6+7+8，该票共8元，由以下4注：5678（四星）、678（三星）、78（二星）、8（一星）构成',
				reward : '前四位为5678，即中四星、三星、二星、一星各1注。' ,
				betType : 'btn_line',
				betBtn : {
					'万位' : {
							betBtn : ['0','1','2','3','4','5','6','7','8','9'],
							spBtn : ['全','大','小','奇','偶','清']
					},
					'千位' : {
							betBtn : ['0','1','2','3','4','5','6','7','8','9'],
							spBtn : ['全','大','小','奇','偶','清']
					},
					'百位' : {
							betBtn : ['0','1','2','3','4','5','6','7','8','9'],
							spBtn : ['全','大','小','奇','偶','清']
					},
					'十位' : {
							betBtn : ['0','1','2','3','4','5','6','7','8','9'],
							spBtn : ['全','大','小','奇','偶','清']
					}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '四星' : '取得中',
			            '三星' : '取得中',
			            '二星' : '取得中',
			            '一星' : '取得中'
		        }
		},
		// 前四_组选24
		// 102
		102 : {
				title : '从0-9中选择4个号码组成一注。',
				help : '从0-9中选择4个号码组成一注。', 
				how :'从0-9中任意选择4个号码组成一注，所选号码与开奖号码的万位、千位、百位、十位相同，且顺序不限，即为中奖。',
				sample : '0568',
				reward : '0568*（顺序不限），即可中四星组选24。' ,
				betType : 'btn_line',
				betBtn : {
						'组选24' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前四_组选12
		// 103
		103 : {
				title : '从“二重号”选择一个号码、“单号”选择两个号码组成一注。',
				help : '从“二重号”选择一个号码、“单号”选择两个号码组成一注。',
				how :'选择1个二重号和2个单号号码组成一注，所选号码与开奖号码的万位、千位、百位、十位相同，且所选的1个二重号码分别在开奖号码中出现2次，以及所选的2个单号出现，即为中奖。',
				sample : '二重号8、单号06',
				reward : '0688*（顺序不限），即可中四星组选12。' ,
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前四_组选6
		// 104
		104 : {
				title : '从“二重号”选择两个号码组成一注。',
				help : '从“二重号”选择两个号码组成一注。',
				how :'选择2个二重号码组成一注，所选的2个二重号码在开奖号码的万位、千位、百位、十位中分别出现了2次，即为中奖。',
				sample : '二重号28',
				reward : '2288*（顺序不限），即可中四星组选6。',
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前四_组选4
		// 105
		105 : {
				title : '从“三重号”选择一个号码、“单号”选择一个号码组成一注。',
				help : '从“三重号”选择一个号码、“单号”选择一个号码组成一注。',
				how :'选择1个三重号码和1个单号组成一注，所选号码与开奖号码的万位、千位、百位、十位相同，且所选三重号码在开奖号码中出现3次，即为中奖。',
				sample : '三重号8、单号2',
				reward : '8828*（顺序不限），即可中四星组选4。' ,
				betType : 'btn_line',
				betBtn : {
						'三重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后三_直选复式
		// 21
		21 : {
				title : '从百位、十位、个位各选一个号码组成一注。',
				help : '从百位、十位、个位各选一个号码组成一注。',
				how :'从百位、十位、个位中选择一个3位数号码组成一注，所选号码与开奖号码后3位相同，且顺序一致，即为中奖。',
				sample : '345',
				reward : '345，即中后三直选。' ,
				betType : 'btn_line',
				betBtn : {
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后三_直选单式
		// 22
		22 : {
				title : '手动输入号码，至少输入1个三位数号码组成一注。',
				help : '手动输入号码，至少输入1个三位数号码组成一注。',
				how :'手动输入一个3位数号码组成一注，所选号码与开奖号码的百位、十位、个相同，且顺序一致，即为中奖。',
				sample : '345',
				reward : '345，即中后三直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 后三_后三组合
		// 23
		23 : {
				title : '从百位、十位、个位各选一个号码组成三注。',
				help : '从百位、十位、个位各选一个号码组成三注。',
				how :'从百位、十位、个位中至少选择一个号码，组成1-3星的组合，共三注，当个位号码与开奖号码对应位相同，则中1个3等奖 ;所选号码的个位、十位与开奖号码对应相位同，则1个3等奖以及1个2等奖，依此类推，最高可中3个奖。',
				sample : '6+7+8，该票共6元，由以下3注：678（三星）、78（二星）、8（一星）构成',
				reward : '后三位为678，即中三星、二星、一星各1注。' ,
				betType : 'btn_line',
				betBtn : {
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
		            '三星' : '取得中',
		            '二星' : '取得中',
		            '一星' : '取得中'
		        }
		},
		// 后三_直选和值
		// 24
		24 : {
				title : '从0-27中任意选择1个或1个以上号码。',
				help : '从0-27中任意选择1个或1个以上号码。', 
				how :'所选数值等于开奖号码的百位、十位、个位三个数字相加之和，即为中奖。',
				sample : '和值1',
				reward : '后三位001、010、100，即为中后三直选。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26','27']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 后三_直选跨度
		// 25
		25 : {
				title : '从0-9中选择1个以上号码。',
				help : '从0-9中选择1个以上号码。',
				how :'所选数值等于开奖号码的后3位最大与最小数字相减之差，即为中奖',
				sample : '跨度8',
				reward : '后三位 08X，其中X不等于9，后三位19X，其中X不等于0，即可中后三直选。' ,
				betType : 'btn_line',
				betBtn : {
						'跨度' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后三_组三复式
		// 26
		26 : {
				title : '从0-9中任意选择2个或2个以上号码。',
				help : '从0-9中任意选择2个或2个以上号码。',
				how :'从0-9中任意选择2个号码组成两注，所选号码与开奖号码的百位、十位、个位相同，且顺序不限，即为中奖。',
				sample : '588',
				reward : '后三位588（顺序不限），即可中后三组选三。' ,
				betType : 'btn_line',
				betBtn : {
						'组三' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后三_组三单式
		// 27
		27 : {
				title : '手动输入号码，至少输入1个三位数号码（三个数字中必须有二个数字相同）。',
				help : '手动输入号码，至少输入1个三位数号码（三个数字中必须有二个数字相同）。',
				how :'手动输入一个3位数号码组成一注，三个数字中必须有两个数字相同，输入号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。',
				sample : '001',
				reward : '后三位010（顺序不限），即可中后三组选三。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 后三_组六复式
		// 28
		28 : {
				title : '从0-9中任意选择3个或3个以上号码。',
				help : '从0-9中任意选择3个或3个以上号码。', 
				how :'从0-9中任意选择3个号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。',
				sample : '258',
				reward : '后三位852（顺序不限），即可中后三组选六。' ,
				betType : 'btn_line',
				betBtn : {
						'组六' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后三_组六单式
		// 29
		29 : {
				title : '手动输入号码，至少输入1个三位数号码（三个数字完全不相同）。',
				help : '手动输入号码，至少输入1个三位数号码（三个数字完全不相同）。',
				how :'手动输入一个3位数号码组成一注，所选号码与开奖号码的百位、十位、个位相同，顺序不限，即为中奖。',
				sample : '123',
				reward : '后三位321（顺序不限），即可中后三组选六。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 后三_混合组选
		// 30
		30 : {
				title : '手动输入号码，至少输入1个三位数号码。',
				help : '手动输入号码，至少输入1个三位数号码。', 
				how :'手动输入一个3位数号码组成一注（不含豹子号），开奖号码的百位、十位、个位符合后三组三或组六均为中奖。',
				sample : '001和123 ',
				reward : '后三位010（顺序不限）即中后三组选三、后三位312（顺序不限）即中后三组选六。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 后三_组选和值
		// 31
		31 : {
				title : '从1-26中选择1个号码。',
				help : '从1-26中选择1个号码。', 
				how :'所选数值等于开奖号码百位、十位、个位三个数字相加之和（非豹子号），即为中奖。',
				sample : '和值3',
				reward : '后三位003（顺序不限）即中后三组选三、后三位012（顺序不限）即中后三组选六。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26']
						]
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 后三_组选包胆
		// 32
		32 : {
				title : '从0-9中选择1个号码。',
				help : '从0-9中选择1个号码。', 
				how :'从0-9中任意选择1个包胆号码，开奖号码的百位、十位、个位中，任意1位与所选包胆号码相同（不含豹子），即为中奖。',
				sample : '包胆3',
				reward : '后三位3XX或33X，即中后三组选三、后三位3XY，即中后三组选六。' ,
				betType : 'btn_line',
				betBtn : {
						'包胆' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : []
						}
				},
				uniSelect : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 后三_和值尾数
		// 33
		33 : {
				title : '从0-9中选择1个号码。',
				help : '从0-9中选择1个号码。',
				how :'所选数值等于开奖号码的百位、十位、个位三个数字相加之和的尾数，即为中奖。',
				sample : '和值尾数8',
				reward : '后三位936，和值位数为8，即中和值尾数。' ,
				betType : 'btn_line',
				betBtn : {
						'和值尾数' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后三_特殊号
		// 34
		34 : {
				title : '选择一个号码形态。',
				help : '选择一个号码形态。', 
				how :'所选的号码特殊属性和开奖号码后3位的属性一致，即为中奖。其中：1.顺子号的个、十、百位不分顺序 2.对子号，指的是开奖号码的后三位当中，任意2位数字相同的三位数号码。',
				sample : '豹子顺子对子',
				reward : '后三位888，即中豹子，后三位678，即中顺子，后三位558，即中对子。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'特殊号' : {
								three : '豹子',
								straight : '顺子',
								pair : '对子'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '豹子' : '取得中',
			            '顺子' : '取得中',
			            '对子' : '取得中'
		        }
		},
		// 中三_直选复式
		// 106
		106 : {
				title : '从千位、百位、十位各选一个号码组成一注。',
				help : '从千位、百位、十位各选一个号码组成一注。', 
				how :'从千位、百位、十位中选择一个3位数号码组成一注，所选号码与开奖号码后3位相同，且顺序一致，即为中奖。',
				sample : '345',
				reward : '345，即中中三直选。' ,
				betType : 'btn_line',
				betBtn : {
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 中三_直选单式
		// 107
		107 : {
				title : '手动输入号码，至少输入1个三位数号码组成一注。',
				help : '手动输入号码，至少输入1个三位数号码组成一注。',
				how :'手动输入一个3位数号码组成一注，所选号码与开奖号码的千位、百位、十位相同，且顺序一致，即为中奖。',
				sample : '345',
				reward : '345，即中中三直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 中三_中三组合
		// 108
		108 : {
				title : '从千位、百位、十位各选一个号码组成三注。',
				help : '从千位、百位、十位各选一个号码组成三注',
				how :'从千位、百位、十位中至少选择一个号码，组成1-3星的组合，共三注，当十位号码与开奖号码对应位相同，则中1个3等奖 ;所选号码的十位、百位与开奖号码对应相位同，则1个3等奖以及1个2等奖，依此类推，最高可中3个奖。',
				sample : '6+7+8，该票共6元，由以下3注：678（三星）、78（二星）、8（一星）构成',
				reward : '中三位为678，即中三星、二星、一星各1注。' ,
				betType : 'btn_line',
				betBtn : {
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '三星' : '取得中',
			            '二星' : '取得中',
			            '一星' : '取得中'
		        }
		},
		// 中三_直选和值
		// 109
		109 : {
				title : '从0-27中任意选择1个或1个以上号码。',
				help : '从0-27中任意选择1个或1个以上号码。', 
				how :'所选数值等于开奖号码的千位、百位、十位三个数字相加之和，即为中奖。',
				sample : '和值1',
				reward : '中三位001、010、100，即为中中三直选。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26','27']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 中三_直选跨度
		// 110
		110 : {
				title : '从0-9中选择1个以上号码。',
				help : '从0-9中选择1个以上号码。',
				how :'所选数值等于开奖号码的中3位最大与最小数字相减之差，即为中奖',
				sample : '跨度8',
				reward : '中三位 08X，其中X不等于9，中三位19X，其中X不等于0，即可中中三直选。' ,
				betType : 'btn_line',
				betBtn : {
						'跨度' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 中三_组三复式
		// 111
		111 : {
				title : '从0-9中任意选择2个或2个以上号码。',
				help : '从0-9中任意选择2个或2个以上号码。',
				how :'从0-9中任意选择2个号码组成两注，所选号码与开奖号码的千位、百位、十位相同，且顺序不限，即为中奖。',
				sample : '588',
				reward : '中三位588（顺序不限），即可中中三组选三。' ,
				betType : 'btn_line',
				betBtn : {
						'组三' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 中三_组三单式
		// 112
		112 : {
				title : '手动输入号码，至少输入1个三位数号码（三个数字中必须有二个数字相同）。',
				help : '手动输入号码，至少输入1个三位数号码（三个数字中必须有二个数字相同）。',
				how :'手动输入一个3位数号码组成一注，三个数字中必须有两个数字相同，输入号码与开奖号码的千位、百位、十位相同，顺序不限，即为中奖。',
				sample : '001',
				reward : '中三位010（顺序不限），即可中中三组选三。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 中三_组六复式
		// 113
		113 : {
				title : '从0-9中任意选择3个或3个以上号码。',
				help : '从0-9中任意选择3个或3个以上号码。',
				how :'从0-9中任意选择3个号码组成一注，所选号码与开奖号码的千位、百位、十位相同，顺序不限，即为中奖。',
				sample : '258',
				reward : '中三位852（顺序不限），即可中中三组选六。' ,
				betType : 'btn_line',
				betBtn : {
						'组六' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 中三_组六单式
		// 114
		114 : {
				title : '手动输入号码，至少输入1个三位数号码（三个数字完全不相同）。',
				help : '手动输入号码，至少输入1个三位数号码（三个数字完全不相同）。',
				how :'手动输入一个3位数号码组成一注，所选号码与开奖号码的千位、百位、十位相同，顺序不限，即为中奖。',
				sample : '123',
				reward : '中三位321（顺序不限），即可中中三组选六。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 中三_混合组选
		// 115
		115 : {
				title : '手动输入号码，至少输入1个三位数号码。',
				help : '手动输入号码，至少输入1个三位数号码。', 
				how :'手动输入一个3位数号码组成一注（不含豹子号），开奖号码的千位、百位、十位符合中三组三或组六均为中奖。',
				sample : '001和123 ',
				reward : '中三位010（顺序不限）即中中三组选三、中三位312（顺序不限）即中中三组选六。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 中三_组选和值
		// 116
		116 : {
				title : '从1-26中选择1个号码。',
				help : '从1-26中选择1个号码。',
				how :'所选数值等于开奖号码千位、百位、十位三个数字相加之和（非豹子号），即为中奖。',
				sample : '和值3',
				reward : '中三位003（顺序不限）即中中三组选三、中三位012（顺序不限）即中中三组选六。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26']
						]
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 中三_组选包胆
		// 117
		117 : {
				title : '从0-9中选择1个号码。',
				help : '从0-9中选择1个号码。',
				how :'从0-9中任意选择1个包胆号码，开奖号码的千位、百位、十位中，任意1位与所选包胆号码相同（不含豹子），即为中奖。',
				sample : '包胆3',
				reward : '中三位3XX或33X，即中中三组选三、中三位3XY，即中中三组选六。' ,
				betType : 'btn_line',
				betBtn : {
						'包胆' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : []
						}
				},
				uniSelect : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 中三_和值尾数
		// 118
		118 : {
				title : '从0-9中选择1个号码。',
				help : '从0-9中选择1个号码。', 
				how :'所选数值等于开奖号码的千位、百位、十位三个数字相加之和的尾数，即为中奖。',
				sample : '和值尾数8',
				reward : '中三位936，和值位数为8，即中和值尾数。' ,
				betType : 'btn_line',
				betBtn : {
						'和值尾数' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 中三_特殊号
		// 119
		119 : {
				title : '选择一个号码形态。',
				help : '选择一个号码形态。',
				how :'所选的号码特殊属性和开奖号码后3位的属性一致，即为中奖。其中：1.顺子号的十、百、千位不分顺序 2.对子号，指的是开奖号码的中三位当中，任意2位数字相同的三位数号码。',
				sample : '豹子顺子对子',
				reward : '中三位888，即中豹子，中三位678，即中顺子，中三位558，即中对子。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'特殊号' : {
								three : '豹子',
								straight : '顺子',
								pair : '对子'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '豹子' : '取得中',
			            '顺子' : '取得中',
			            '对子' : '取得中'
		        }
		},
		// 前三_直选复式
		// 35
		35 : {
				title : '从万位、千位、百位各选一个号码组成一注。',
				help : '从万位、千位、百位各选一个号码组成一注。', 
				how :'从万位、千位、百位中选择一个3位数号码组成一注，所选号码与开奖号码后3位相同，且顺序一致，即为中奖。',
				sample : '345',
				reward : '345，即中前三直选。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前三_直选单式
		// 36
		36 : {
				title : '手动输入号码，至少输入1个三位数号码组成一注。',
				help : '手动输入号码，至少输入1个三位数号码组成一注。',
				how :'手动输入一个3位数号码组成一注，所选号码与开奖号码的万位、千位、百位相同，且顺序一致，即为中奖。',
				sample : '345',
				reward : '前三位345，即中前三直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 前三_前三组合
		// 37
		37 : {
				title : '从万位、千位、百位各选一个号码组成三注。',
				help : '从万位、千位、百位各选一个号码组成三注。',
				how :'从万位、千位、百位中至少选择一个号码，组成1-3星的组合共三注，当百位号码与开奖号码对应位相同，则中1个3等奖 ;如果所选号码的百位、千位与开奖号码对应相位同，则中1个3等奖以及1个2等奖，依此类推，最高可中3个奖。',
				sample : '6+7+8，该票共6元，由以下3注：678（三星）、78（二星）、8（一星）构成',
				reward : '前三位为678，即中三星、二星、一星各1注。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '三星' : '取得中',
			            '二星' : '取得中',
			            '一星' : '取得中'
		        }
		},
		// 前三_直选和值
		// 38
		38 : {
				title : '从0-27中任意选择1个或1个以上号码。',
				help : '从0-27中任意选择1个或1个以上号码。',
				how :'所选数值等于开奖号码的万位、千位、百位三个数字相加之和，即为中奖。',
				sample : '和值1',
				reward : '前三位001、010、100，即为中前三直选。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26','27']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 前三_直选跨度
		// 39
		39 : {
				title : '从0-9中选择1个以上号码。',
				help : '从0-9中选择1个以上号码。',
				how :'所选数值等于开奖号码的前3位最大与最小数字相减之差，即为中奖。',
				sample : '跨度8',
				reward : '前三位 08X，其中X不等于9、前三位19X，其中X不等于0，即可中前三直选。' ,
				betType : 'btn_line',
				betBtn : {
						'跨度' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前三_组三复式
		// 40
		40 : {
				title : '从0-9中任意选择2个或2个以上号码。',
				help : '从0-9中任意选择2个或2个以上号码。',
				how :'从0-9中任意选择2个号码组成两注，所选号码与开奖号码的万位、千位、百位相同，且顺序不限，即为中奖。',
				sample : '588',
				reward : '前三位588（顺序不限），即可中前三组选三。' ,
				betType : 'btn_line',
				betBtn : {
						'组三' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前三_组三单式
		// 41
		41 : {
				title : '手动输入号码，至少输入1个三位数号码（三个数字中必须有二个数字相同）。',
				help : '手动输入号码，至少输入1个三位数号码（三个数字中必须有二个数字相同）。',
				how :'手动输入一个3位数号码组成一注，三个数字当中必须有两个数字相同，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。',
				sample : '588',
				reward : '前三位588（顺序不限），即可中前三组选三。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 前三_组六复式
		// 42
		42 : {
				title : '从0-9中任意选择3个或3个以上号码。',
				help : '从0-9中任意选择3个或3个以上号码。', 
				how :'从0-9中任意选择3个号码组成一注，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。',
				sample : '258',
				reward : '前三位852（顺序不限），即可中前三组选六。' ,
				betType : 'btn_line',
				betBtn : {
						'组六' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前三_组六单式
		// 43
		43 : {
				title : '手动输入号码，至少输入1个三位数号码（三个数字完全不相同）。',
				help : '手动输入号码，至少输入1个三位数号码（三个数字完全不相同）。',
				how :'手动输入一个3位数号码组成一注，所选号码与开奖号码的万位、千位、百位相同，顺序不限，即为中奖。',
				sample : '123',
				reward : '前三位312（顺序不限），即可中前三组选六。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 前三_混合组选
		// 44
		44 : {
				title : '手动输入号码，至少输入1个三位数号码。',
				help : '手动输入号码，至少输入1个三位数号码。', 
				how :'手动输入一个3位数号码组成一注（不含豹子号），开奖号码的万位、千位、百位符合前三组三或组六均为中奖。',
				sample : '001和123',
				reward : '前三位010（顺序不限）即中前三组选三、前三位312（顺序不限）即中前三组选六。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 前三_组选和值
		// 45
		45 : {
				title : '从1-26中选择1个号码。',
				help : '从1-26中选择1个号码。',
				how :'所选数值等于开奖号码万位、千位、百位三个数字相加之和（非豹子号），即为中奖。',
				sample : '和值3',
				reward : '前三位003（顺序不限）即中前三组选三、前三位012（顺序不限）即中前三组选六。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26']
						]
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 前三_组选包胆
		// 46
		46 : {
				title : '从0-9中选择1个号码。',
				help : '从0-9中选择1个号码。', 
				how :'从0-9中任意选择1个包胆号码，开奖号码的万位、千位、百位中，任意1位与所选包胆号码相同，即为中奖。',
				sample : '包胆3',
				reward : '前三位3XX或33X，即中前三组选三、前三位3XY，即中前三组选六。' ,
				betType : 'btn_line',
				betBtn : {
						'包胆' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : []
						}
				},
				uniSelect : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '组三' : '取得中',
			            '组六' : '取得中'
		        }
		},
		// 前三_和值尾数
		// 47
		47 : {
				title : '从0-9中选择1个号码。',
				help : '从0-9中选择1个号码。',
				how :'所选数值等于开奖号码的万位、千位、百位、三个数字相加之和的尾数，即为中奖。',
				sample : '和值尾数8',
				reward : '前三位936，和值位数为8，即中和值尾数。' ,
				betType : 'btn_line',
				betBtn : {
						'和值尾数' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前三_特殊号
		// 48
		48 : {
				title : '选择一个号码形态。',
				help : '选择一个号码形态。', 
				how :'所选的号码特殊属性和开奖号码前3位的属性一致，即为中奖。其中：1.顺子号的万、千、百位不分顺序 2.对子号，指的是开奖号码的前三位当中，任意2位数字相同的三位数号码。',
				sample : '豹子顺子对子',
				reward : '前三位888，即中豹子，前三位678，即中顺子，前三位558，即中对子。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'特殊号' : {
						    		three : '豹子',
								straight : '顺子',
								pair : '对子'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '豹子' : '取得中',
			            '顺子' : '取得中',
			            '对子' : '取得中'
		        }
		},
		// 后二_直选复式
		// 49
		49 : {
				title : '从十位、个位中至少各选1个号码组成一注。',
				help : '从十位、个位中至少各选1个号码组成一注。', 
				how :'从十位、个位中选择一个2位数号码组成一注，所选号码与开奖号码后2位相同，且顺序一致，即为中奖。',
				sample : '58',
				reward : '后二位58，即中后二直选。' ,
				betType : 'btn_line',
				betBtn : {
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后二_直选单式
		// 50
		50 : {
				title : '手动输入号码，至少输入1个二位数号码组成一注。',
				help : '手动输入号码，至少输入1个二位数号码组成一注。',
				how :'手动输入一个2位数号码组成一注，输入号码的十位、个位与开奖号码相同，且顺序一致，即为中奖。',
				sample : '58',
				reward : '后二位58，即中后二直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 后二_直选和值
		// 51
		51 : {
				title : '从0-18中任意选择1个或1个以上的和值号码。',
				help : '从0-18中任意选择1个或1个以上的和值号码。',
				how :'所选数值等于开奖号码的十位、个位二个数字相加之和，即为中奖。',
				sample : '和值1',
				reward : '后二位01、10，即为中后二直选。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9'],
								['10','11','12','13','14','15','16','17','18']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 后二_直选跨度
		// 52
		52 : {
				title : '从0-9中选择1个以上号码。',
				help : '从0-9中选择1个以上号码。',
				how :'所选数值等于开奖号码的后2位最大与最小数字相减之差，即为中奖。',
				sample : '跨度9',
				reward : '后二位90或09，即可中后二直选。' ,
				betType : 'btn_line',
				betBtn : {
						'跨度' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后二_组选复式
		// 53
		53 : {
				title : '从0-9中任意选择2个或2个以上号码。',
				help : '从0-9中任意选择2个或2个以上号码。', 
				how :'从0-9中任意选2个号码组成一注，所选号码与开奖号码的十位、个位相同（不含对子号），顺序不限，即为中奖。',
				sample : '58',
				reward : '后二位85或58（顺序不限，不含对子号），即中后二组选。' ,
				betType : 'btn_line',
				betBtn : {
						'组选' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 后二_组选单式
		// 54
		54 : {
				title : '手动输入号码，至少输入1个二位数号码组成一注。',
				help : '手动输入号码，至少输入1个二位数号码组成一注。',
				how :'手动输入一个2位数号码组成一注，输入号码的十位、个位与开奖号码相同（不含对子号），顺序不限，即为中奖。',
				sample : '58',
				reward : '后二位85或58（顺序不限，不含对子号），即中后二组选。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 后二_组选和值
		// 55
		55 : {
				title : '从1-17中任意选择1个或者1个以上号码。',
				help : '从1-17中任意选择1个或者1个以上号码。', 
				how :'所选数值等于开奖号码十位、个位二个数字相加之和（不含对子号），即为中奖。',
				sample : '和值1',
				reward : '后二位10或01（顺序不限，不含对子号），即为中后二组选。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['1','2','3','4','5','6','7','8','9'],
								['10','11','12','13','14','15','16','17']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 后二_组选包胆
		// 56
		56 : {
				title : '从0-9中选择1个包胆号码。',
				help : '从0-9中选择1个包胆号码。', 
				how :'从0-9中任意选择1个包胆号码，开奖号码的十位、个位中，任意1位与所选包胆号码相同（不含对子），即为中奖。',
				sample : '包胆8',
				reward : '后二位8X，且X不等于8，即中后二组选。' ,
				betType : 'btn_line',
				betBtn : {
						'包胆' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : []
						}
				},
				uniSelect : true,
				posSelect : false,
				percentSelect : true
		},
		// 前二_直选复式
		// 57
		57 : {
				title : '从万位、千位中至少各选1个号码组成一注。',
				help : '从万位、千位中至少各选1个号码组成一注。', 
				how :'从万位、千位中选择一个2位数号码组成一注，所选号码与开奖号码的前2位相同，且顺序一致，即为中奖。',
				sample : '58',
				reward : '前二位58，即中前二直选。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前二_直选单式
		// 58
		58 : {
				title : '手动输入号码，至少输入1个二位数号码组成一注。',
				help : '手动输入号码，至少输入1个二位数号码组成一注。', 
				how :'手动输入一个2位数号码组成一注，输入号码的万位、千位与开奖号码相同，且顺序一致，即为中奖。',
				sample : '58',
				reward : '前二位58，即中前二直选。' ,
				betType : 'text',
				posSelect : false,
				percentSelect : true
		},
		// 前二_直选和值
		// 59
		59 : {
				title : '从0-18中任意选择1个或1个以上的和值号码。',
				help : '从0-18中任意选择1个或1个以上的和值号码。', 
				how :'所选数值等于开奖号码的万位、千位二个数字相加之和，即为中奖。',
				sample : '和值1',
				reward : '前二位01、10，即为中前二直选。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9'],
								['10','11','12','13','14','15','16','17','18']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 前二_直选跨度
		// 60
		60 : {
				title : '从0-9中选择1个以上号码。',
				help : '从0-9中选择1个以上号码。', 
				how :'所选数值等于开奖号码的前2位最大与最小数字相减之差，即为中奖。',
				sample : '跨度9',
				reward : '前二位90或09，即可中前二直选。' ,
				betType : 'btn_line',
				betBtn : {
						'跨度' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前二_组选复式
		// 61
		61 : {
				title : '从0-9中任意选择2个或2个以上号码。',
				help : '从0-9中任意选择2个或2个以上号码。',
				how :'从0-9中任意选2个号码组成一注，所选号码与开奖号码的万位、千位相同，顺序不限，即为中奖。',
				sample : '58',
				reward : '前二位85或58（顺序不限，不含对子号），即中前二组选。' ,
				betType : 'btn_line',
				betBtn : {
						'组选' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 前二_组选单式
		// 62
		62 : {
				title : '手动输入号码，至少输入1个二位数号码组成一注。',
				help : '手动输入号码，至少输入1个二位数号码组成一注。', 
				how :'手动输入一个2位数号码组成一注，输入号码的万位、千位与开奖号码相同，顺序不限，即为中奖。',
				sample : '58',
				reward : '前二位85或58（顺序不限，不含对子号），即中前二组选。' ,
				betType : 'text',
				posSelect : false,
				setSort : true,
				percentSelect : true
		},
		// 前二_组选和值
		// 63
		63 : {
				title : '从1-17中任意选择1个或者1个以上号码。',
				help : '从万位、千位、百位、十位、个位各选一个号码组成一注', 
				how :'所选数值等于开奖号码万位、千位二个数字相加之和（不含对子号），即为中奖。',
				sample : '和值1',
				reward : '前二位10或01（顺序不限，不含对子号），即为中前二组选。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['1','2','3','4','5','6','7','8','9'],
								['10','11','12','13','14','15','16','17']
						]
				},
				posSelect : false,
				percentSelect : true
		},
		// 前二_组选包胆
		// 64
		64 : {
				title : '从0-9中选择1个包胆号码。',
				help : '从0-9中选择1个包胆号码。', 
				how :'从0-9中任意选择1个包胆号码，开奖号码的万位、个位中，任意1位与所选包胆号码相同（不含对子），即为中奖。',
				sample : '包胆8',
				reward : '前二位8X，且X不等于8，即中前二组选包胆。' ,
				betType : 'btn_line',
				betBtn : {
						'包胆' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : []
						}
				},
				uniSelect : true,
				posSelect : false,
				percentSelect : true
		},
		// 定位胆
		// 65
		65 : {
				title : '在万位、千位、百位、十位、个位任意位置上任意选择1个或1个以上号码。',
				help : '在万位、千位、百位、十位、个位任意位置上任意选择1个或1个以上号码。',
				how :'从万位、千位、百位、十位、个位任意位置上至少选择1个以上号码，所选号码与相同位置上的开奖号码一致，即为中奖。',
				sample : '万位1',
				reward : '万位1，即中定位胆万位。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_后三一码
		// 66
		66 : {
				title : '从0-9中任意选择1个以上号码。',
				help : '从0-9中任意选择1个以上号码。',
				how :'从0-9中任意选择1个号码，每注由1个号码组成，只要开奖号码的百位、十位、个位包含所选号码，即为中奖。',
				sample : '1',
				reward : '后三位置至少出现1个1，即中后三一码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_前三一码
		// 67
		67 : {
				title : '从0-9中任意选择1个以上号码。',
				help : '从0-9中任意选择1个以上号码。', 
				how :'从0-9中任意选择1个号码，每注由1个号码组成，只要开奖号码的万位、千位、百位包含所选号码，即为中奖。',
				sample : '1',
				reward : '前三位置至少出现1个1，即中前三一码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_后三二码
		// 68
		68 : {
				title : '从0-9中任意选择2个以上号码。',
				help : '从0-9中任意选择2个以上号码。', 
				how :'从0-9中任意选择2个号码，每注由2个不同的号码组成，只要开奖号码的百位、十位、个位包含所选的2个号码，即为中奖。',
				sample : '12',
				reward : '后三位置至少出现1和2各1个，即中后三二码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_前三二码
		// 69
		69 : {
				title : '从0-9中任意选择2个以上号码。',
				help : '从0-9中任意选择2个以上号码。', 
				how :'从0-9中任意选择2个号码，每注由2个不同的号码组成，只要开奖号码的万位、千位、百位同时包含所选的2个号码，即为中奖。',
				sample : '12',
				reward : '前三位置至少出现1和2各1个，即中前三二码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_四星一码
		// 70
		70 : {
				title : '从0-9中任意选择1个以上号码。',
				help : '从0-9中任意选择1个以上号码。', 
				how :'从0-9中任意选择1个号码，每注由1个号码组成，只要开奖号码的千位、百位、个位同时包含所选的号码，即为中奖。',
				sample : '1',
				reward : '后四位置至少出现1个1，即中四星一码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_四星二码
		// 71
		71 : {
				title : '从0-9中任意选择2个以上号码。',
				help : '从0-9中任意选择2个以上号码。', 
				how :'从0-9中任意选择2个号码，每注由2个号码不同的号码组成，只要开奖号码的千位、百位、十位、个位同时包含所选的2个号码，即为中奖。',
				sample : '12',
				reward : '后四位置至少出现1和2各1个，即中四星二码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_五星二码
		// 72
		72 : {
				title : '从0-9中任意选择2个以上号码。',
				help : '从0-9中任意选择2个以上号码。',
				how :'从0-9中任意选择2个号码，每注由2个号码不同的号码组成，只要开奖号码的万位、千位、百位、十位、个位中同时包含所选的2个号码，即为中奖。',
				sample : '12',
				reward : '至少出现1和2各1个，即中五星二码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 不定位_五星三码
		// 73
		73 : {
				title : '从0-9中任意选择3个以上号码。',
				help : '从0-9中任意选择3个以上号码。',
				how :'从0-9中任意选择3个号码，每注由3个不同的号码组成，只要开奖号码的万位、千位、百位、十位、个位中同时包含所选的3个号码，即为中奖。',
				sample : '123',
				reward : '至少出现1、2、3各1个，即中五星三码不定位。' ,
				betType : 'btn_line',
				betBtn : {
						'不定位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 大小单双_前二大小单双
		// 74
		74 : {
				title : '从万位、千位中的“大、小、单、双”中至少各选一个组成一注。',
				help : '从万位、千位中的“大、小、单、双”中至少各选一个组成一注。',
				how :'对万位、千位的\"大（56789）小（01234）、单（13579）双（02468）\"形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。',
				sample : '小双',
				reward : '万位与千位“小双”，即中前二大小单双。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'万位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						},
						'千位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 大小单双_后二大小单双
		// 75
		75 : {
				title : '从十位、个位中的“大、小、单、双”中至少各选一个组成一注。',
				help : '从十位、个位中的“大、小、单、双”中至少各选一个组成一注。', 
				how :'对十位、个位的\"大（56789）小（01234）、单（13579）双（02468）\"形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。',
				sample : '大单',
				reward : '十位与个位“大单”，即中后二大小单双。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'十位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						},
						'个位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 大小单双_前三大小单双
		// 76
		76 : {
				title : '从万位、千位、百位中的“大、小、单、双”中至少各选一个组成一注。',
				help : '从万位、千位、百位中的“大、小、单、双”中至少各选一个组成一注。',
				how :'对万位、千位和百位的\"大（56789）小（01234）、单（13579）双（02468）\"形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。',
				sample : '小双小',
				reward : '万位、千位、百位“小双小”，即中前三大小单双。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'万位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						},
						'千位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						},
						'百位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 大小单双_后三大小单双
		// 77
		77 : {
				title : '从百位、十位、个位中的“大、小、单、双”中至少各选一个组成一注。',
				help : '从百位、十位、个位中的“大、小、单、双”中至少各选一个组成一注。', 
				how :'对百位、十位和个位的\"大（56789）小（01234）、单（13579）双（02468）\"形态进行购买，所选号码的位置、形态与开奖号码的位置、形态相同，即为中奖。',
				sample : '大单大',
				reward : '百位、十位、个位“大单大”，即中后三大小单双。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'百位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						},
						'十位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						},
						'个位' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 五星_总和大小单双
		// 144
		144 : {
				title : '总和为0~22为小，23~45为大；总和尾数单为单，总和尾数双数为双。',
				help : '总和为0~22为小，23~45为大；总和尾数单为单，总和尾数双数为双。', 
				how :'总和为0~22为小，23~45为大；总和尾数单为单，总和尾数双数为双。',
				sample : '小',
				reward : '12345，即中和值小。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'总和大小单双' : {
								big : '大',
								small : '小',
								single : '单',
								double : '双'
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 龙虎_万千
		// 120
		120 : {
				title : '开奖结果万位大于千位为龙、千位大于万位为虎、二者相同为和；万千总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果万位大于千位为龙、千位大于万位为虎、二者相同为和；万千总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>', 
				how :'开奖结果万位大于千位为龙、千位大于万位为虎、二者相同为和；万千总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '龙、大',
				reward : '54321，即中龙虎和万千，和值大。' ,
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_万百
		// 121
		121 : {
				title : '开奖结果万位大于百位为龙、百位大于万位为虎、二者相同为和；万百总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果万位大于百位为龙、百位大于万位为虎、二者相同为和；万百总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果万位大于百位为龙、百位大于万位为虎、二者相同为和；万百总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '虎、小',
				reward : '12345，即中龙虎和万百，和值小。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_万十
		// 122
		122 : {
				title : '开奖结果万位大于十位为龙、十位大于万位为虎、二者相同为和；万十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果万位大于十位为龙、十位大于万位为虎、二者相同为和；万十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果万位大于十位为龙、十位大于万位为虎、二者相同为和；万十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '龙、大',
				reward : '54321，即中龙虎和万十，和值大。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_万个
		// 123
		123 : {
				title : '开奖结果万位大于个位为龙、个位大于万位为虎、二者相同为和；万个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果万位大于个位为龙、个位大于万位为虎、二者相同为和；万个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果万位大于个位为龙、个位大于万位为虎、二者相同为和；万个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '虎、大',
				reward : '12345，即中龙虎和万个，和值大。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_千百
		// 124
		124 : {
				title : '开奖结果千位大于百位为龙、百位大于千位为虎、二者相同为和；千百总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果千位大于百位为龙、百位大于千位为虎、二者相同为和；千百总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果千位大于百位为龙、百位大于千位为虎、二者相同为和；千百总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '龙、大',
				reward : '54321，即中龙虎和千百，和值大。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_千十
		// 125
		125 : {
				title : '开奖结果千位大于十位为龙、十位大于千位为虎、二者相同为和；千十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果千位大于十位为龙、十位大于千位为虎、二者相同为和；千十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果千位大于十位为龙、十位大于千位为虎、二者相同为和；千十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '虎、大',
				reward : '12345，即中龙虎和千十，和值大。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_千个
		// 126
		126 : {
				title : '开奖结果千位大于个位为龙、个位大于千位为虎、二者相同为和；千个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果千位大于个位为龙、个位大于千位为虎、二者相同为和；千个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果千位大于个位为龙、个位大于千位为虎、二者相同为和；千个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '龙、大',
				reward : '54321，即中龙虎和千个，和值大。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_百十
		// 127
		127 : {
				title : '开奖结果百位大于十位为龙、十位大于百位为虎、二者相同为和；百十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果百位大于十位为龙、十位大于百位为虎、二者相同为和；百十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果百位大于十位为龙、十位大于百位为虎、二者相同为和；百十总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '虎、大',
				reward : '12345，即中龙虎和百十，和值大。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_百个
		// 128
		128 : {
				title : '开奖结果百位大于个位为龙、个位大于百位为虎、二者相同为和；百个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果百位大于个位为龙、个位大于百位为虎、二者相同为和；百个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果百位大于个位为龙、个位大于百位为虎、二者相同为和；百个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '龙、小',
				reward : '54321，即中龙虎和百个，和值小。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 龙虎_十个
		// 129
		129 : {
				title : '开奖结果十位大于个位为龙、个位大于十位为虎、二者相同为和；十个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				help : '开奖结果十位大于个位为龙、个位大于十位为虎、二者相同为和；十个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				how : '开奖结果十位大于个位为龙、个位大于十位为虎、二者相同为和；十个总和的个位数1,3,5,7,9时为“单”，0,2,4,6,8时为“双”；5~9为“大”，0~4时为“小”。<br/>',
				sample : '虎、大',
				reward : '12345，即中龙虎和十个，和值大。',
				betType : 'btn_line',				
				betBtn : {
						'龙虎和' : {
								betBtn : ['dragon','tiger','tie'],
								spBtn : []
						},
						'和值' : {
								betBtn : ['big','small','single','double'],
								spBtn : []
						}
				},
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '龙' : '取得中',
			            '虎' : '取得中',
			            '和' : '取得中',
			            '大小单双' : '取得中'
		        }
		},
		// 任二直选_直选复式
		// 78
		78 : {
				title : '从万位、千位、百位、十位、个位中至少两个位置上各选1个号码组成一注。',
				help : '从万位、千位、百位、十位、个位中至少两个位置上各选1个号码组成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择两位置，各选1个号码组成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序一致，即为中奖。',
				sample : '万位5、百位8',
				reward : '51812，即中任二直选。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 任二直选_直选单式
		// 79
		79 : {
				title : '从万位、千位、百位、十位、个位中至少选择两个位置，至少输入两个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择两个位置，至少输入两个号码构成一注。',
				how :'从万位、千位、百位、十位、个位中至少选择两个位置，至少手动输入一个两位数的号码构成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序一致，即为中奖。',
				sample : '位置选择万位、百位，输入号码58',
				reward : '51812，即中任二直选。' ,
				betType : 'text',
				posSelect : true,
				percentSelect : true
		},
		// 任二直选_直选和值
		// 80
		80 : {
				title : '从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码构成一注。',
				how :'从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码组成一注，所选号码与开奖号码的和值相同，即为中奖。',
				sample : '位置选择万位、百位，选择和值号码13',
				reward : '51812，即中任二直选和值' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9'],
								['10','11','12','13','14','15','16','17','18']
						]
				},
				posSelect : true,
				percentSelect : true
		},
		// 任二组选_组选复式
		// 81
		81 : {
				title : '从万位、千位、百位、十位、个位中至少选择两个位置，号码区至少选择两个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择两个位置，号码区至少选择两个号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择两个位置，号码区至少选择两个号码组成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序不限，即为中奖。',
				sample : '位置选择万位、百位，输入号码85',
				reward : '51812或81512，即中任二组选。' ,
				betType : 'btn_line',
				betBtn : {
						'组选' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : true,
				percentSelect : true
		},
		// 任二组选_组选单式
		// 82
		82 : {
				title : '从万位、千位、百位、十位、个位中至少选择两个位置，至少手动输入两个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择两个位置，至少手动输入两个号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择两个位置，至少手动输入一个两位数的号码构成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序不限，即为中奖。',
				sample : '位置选择万位、百位，输入号码85',
				reward : '51812或81512，即中任二组选。' ,
				betType : 'text',
				posSelect : true,
				setSort : true,
				percentSelect : true
		},
		// 任二组选_组选和值
		// 83
		83 : {
				title : '从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码构成一注，所选号码与开奖号码的和值相同，即为中奖。',
				sample : '位置选择万位、百位，选择和值号码4',
				reward : '12315，即中任二组选和值。（不含对子号）' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['1','2','3','4','5','6','7','8','9'],
								['10','11','12','13','14','15','16','17']
						]
				},
				posSelect : true,
				percentSelect : true
		},
		// 任三直选_直选复式
		// 84
		84 : {
				title : '从万位、千位、百位、十位、个位中至少三个位置上各选1个号码组成一注。',
				help : '从万位、千位、百位、十位、个位中至少三个位置上各选1个号码组成一注。',
				how :'从万位、千位、百位、十位、个位中至少三个位置上各选1个号码组成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序一致，即为中奖。',
				sample : '万位5、百位8、个位2',
				reward : '51812，即中任三直选。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 任三直选_直选单式
		// 85
		85 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，至少输入三个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，至少输入三个号码构成一注。', 
				how :'从万位、千百、百位、十位、个位中至少三个位置，至少手动输入一个三位数的号码构成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序一致，即为中奖。',
				sample : '位置选择万位、百位、个位，输入号码582',
				reward : '51812，即中任三直选。' ,
				betType : 'text',
				posSelect : true,
				percentSelect : true
		},
		// 任三直选_直选和值
		// 86
		86 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，至少选择一个和值号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，至少选择一个和值号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择三个位置，至少选择一个和值号码构成一注，所选号码与开奖号码的和值相同，即为中奖。',
				sample : '位置选择万位、百位、个位，选择和值号码15',
				reward : '51812，即中任三直选和值。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['0','1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26','27']
						]
				},
				posSelect : true,
				percentSelect : true
		},
		// 任三组选_组三复式
		// 87
		87 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，号码区至少选择两个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，号码区至少选择两个号码构成一注。',
				how :'从万位、千位、百位、十位、个位中至少选择三个位置，至少选择两个号码组成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序不限，即为中奖。',
				sample : '位置选择万位、十位、个位，选择号码12',
				reward : '11812，即中任三组选。' ,
				betType : 'btn_line',
				betBtn : {
						'组三' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : true,
				percentSelect : true
		},
		// 任三组选_组三单式
		// 88
		88 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，至少手动输入三个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，至少手动输入三个号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择三个位置，至少手动输入一个三个数的号码构成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序不限，即为中奖。',
				sample : '位置选择万位、十位、个位，输入号码112',
				reward : '11812，即中任三组选。' ,
				betType : 'text',
				posSelect : true,
				setSort : true,
				percentSelect : true
		},
		// 任三组选_组六复式
		// 89
		89 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，号码区至少选择三个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，号码区至少选择三个号码构成一注。',
				how :'从万位、千位、百位、十位、个位中至少选择三个位置，至少选择三个号码组成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序不限，即为中奖。',
				sample : '位置选择万位、十位、个位，选择号码512',
				reward : '51812，即中任三组六。' ,
				betType : 'btn_line',
				betBtn : {
						'组六' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : true,
				percentSelect : true
		},
		// 任三组选_组六单式
		// 90
		90 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，至少手动输入三个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，至少手动输入三个号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择三个位置，手动至少输入三个号码组成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序不限，即为中奖。',
				sample : '位置选择万位、十位、个位，输入号码512',
				reward : '51812，即中任三组六。' ,
				betType : 'text',
				posSelect : true,
				setSort : true,
				percentSelect : true
		},
		// 任三组选_混合组选
		// 91
		91 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，手动至少输入三个号码构成一注（不包含豹子号）。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，手动至少输入三个号码构成一注（不包含豹子号）。', 
				how :'从万位、千位、百位、十位、个位中至少选择三个位置，手动至少输入三个号码组成一注（不含豹子号），所选号码与开奖号码的指定位置上的号码相同，且顺序不限，即为中奖。',
				sample : '位置选择万位、十位、个位，输入号码512',
				reward : '51812，即中任三混合组选。' ,
				betType : 'text',
				posSelect : true,
				setSort : true,
				percentSelect : true
		},
		// 任三组选_组选和值
		// 92
		92 : {
				title : '从万位、千位、百位、十位、个位中至少选择三个位置，至少选择一个和值号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择三个位置，至少选择一个和值号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少选择两个位置，至少选择一个和值号码组成一注，所选号码与开奖号码的和值（不含豹子号）相同，即为中奖。',
				sample : '位置选择万位、十位、个位，选择和值号码8',
				reward : '51812，即中任三组选和值。' ,
				betType : 'btn_multi_line',
				betBtn : {
						'和值' : [
								['1','2','3','4','5','6','7','8','9','10','11','12','13'],
								['14','15','16','17','18','19','20','21','22','23','24','25','26']
						]
				},
				posSelect : true,
				percentSelect : true
		},
		// 任四直选_直选复式
		// 93
		93 : {
				title : '从万位、千位、百位、十位、个位中至少四个位置上各选1个号码组成一注。',
				help : '从万位、千位、百位、十位、个位中至少四个位置上各选1个号码组成一注。',
				how :'从万位、千位、百位、十位、个位中至少四个上各选择1个号码组成一注，所选号码与开奖号码的指定位置上号码相同，且顺序一致，即为中奖。',
				sample : '万位5、千位1、百位8、十位1',
				reward : '51812，即中任四直选。' ,
				betType : 'btn_line',
				betBtn : {
						'万位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'千位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'百位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'十位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'个位' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : false,
				percentSelect : true
		},
		// 任四直选_直选单式
		// 94
		94 : {
				title : '从万位、千位、百位、十位、个位中至少选择四个位置，至少输入四个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择四个位置，至少输入四个号码构成一注。',
				how :'从万位、千位、百位、十位、个位中至少选择四个位置，手动至少输入四位数号码组成一注，所选号码与开奖号码的指定位置上的号码相同，且顺序一致，即为中奖。',
				sample : '位置选择万位、千位、百位、十位，输入号码5182',
				reward : '51812，即中任四直选。' ,
				betType : 'text',
				posSelect : true,
				percentSelect : true
		},
		// 任四组选_组选24
		// 95
		95 : {
				title : '从万位、千位、百位、十位、个位中至少选择四个位置，号码区至少选择四个号码构成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择四个位置，号码区至少选择四个号码构成一注。', 
				how :'从万位、千位、百位、十位、个位中至少四个位置，至少选择4个号码组成一注，所选号码与开奖号码的指定位置上号码相同，且顺序不限，即为中奖。',
				sample : '位置选择千位、百位、十位、个位，号码选择0568',
				reward : '10568（指定位置号码顺序不限），即可中任四组选24。' ,
				betType : 'btn_line',
				betBtn : {
						'组选24' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : true,
				percentSelect : true
		},
		// 任四组选_组选12
		// 96
		96 : {
				title : '从万位、千位、百位、十位、个位中至少选择四个位置，从“二重号”选择一个号码、“单号”选择两个号码组成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择四个位置，从“二重号”选择一个号码、“单号”选择两个号码组成一注。', 
				how :'从千位、百位、十位、个位中至少四个位置，从\"二重号\"选择一个号码，\"单号\"中选择两个号码组成一注，所选号码与开奖号码的指定位置上号码相同，且顺序不限，即为中奖。',
				sample : '位置选择千位、百位、十位、个位，二重号：8、单号：06',
				reward : '10688（指定位置号码顺序不限），即可中任四组选12。' ,
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : true,
				percentSelect : true
		},
		// 任四组选_组选6
		// 97
		97 : {
				title : '从万位、千位、百位、十位、个位中至少选择四个位置，从“二重号”选择两个号码组成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择四个位置，从“二重号”选择两个号码组成一注。', 
				how :'从千位、百位、十位、个位中至少四个位置，从\"二重号\"选择两个号码组成一注，所选号码与开奖号码的指定位置上号码相同，且顺序不限，即为中奖。',
				sample : '选择位置千位、百位、十位、个位，二重号：2、8',
				reward : '12288（指定位置号码顺序不限），即可中任四组选6。' ,
				betType : 'btn_line',
				betBtn : {
						'二重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : true,
				percentSelect : true
		},
		// 任四组选_组选4
		// 98
		98 : {
			
				title : '从万位、千位、百位、十位、个位中至少选择四个位置，从“三重号”选择一个号码、“单号”选择一个号码组成一注。',
				help : '从万位、千位、百位、十位、个位中至少选择四个位置，从“三重号”选择一个号码、“单号”选择一个号码组成一注。', 
				how :'从千位、百位、十位、个位中至少四个位置，从\"三重号\"中选择一个号码，\"单号\"中选择一个号码组成一注，所选号码与开奖号码的指定位置上号码相同，且顺序不限，即为中奖。',
				sample : '位置选择千位、百位、十位、个位，三重号：8、单号：2',
				reward : '18828（指定位置号码顺序不限），即可中任四组选4。' ,
				betType : 'btn_line',
				betBtn : {
						'三重号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						},
						'单号' : {
								betBtn : ['0','1','2','3','4','5','6','7','8','9'],
								spBtn : ['全','大','小','奇','偶','清']
						}
				},
				posSelect : true,
				percentSelect : true
		},
		// 百家乐_庄闲和
		// 131
		131 : {
			
				title : '庄闲对比，谁最接近9点即为胜方，而相同点数即和局。',
				help : '庄闲对比，谁最接近9点即为胜方，而相同点数即和局。', 
				how :'庄闲对比，谁最接近9点即为胜方，而相同点数即和局。',
				sample : '庄',
				reward : '90123，即中庄。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'庄闲和' : {
								bcr_bank : '庄',
								bcr_play : '闲',
								bcr_tie : '和'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
			            '庄' : '取得中',
			            '闲' : '取得中',
			            '和' : '取得中'
		        }
		},
		// 百家乐_庄闲对
		// 132
		132 : {
			
				title : '两家首发(第一轮)的两张牌为对子，不含第三张。',
				help : '两家首发(第一轮)的两张牌为对子，不含第三张。', 
				how :'两家首发(第一轮)的两张牌为对子，不含第三张。',
				sample : '庄对',
				reward : '55842，投庄对则中奖，投闲对不中奖。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'庄闲对' : {
								bcr_bank_pair : '庄对',
								bcr_play_pair : '闲对'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true
		},
		// 百家乐_庄闲大小单双质合
		// 133
		133 : {
			
				title : '以庄闲的点数来进行判断结果。 0~4为小，5~9为大; 1、3、5、7、9为单，0、2、4、6、8为双; 1、2、3、5、7为质数，0、4、6、8、9为合数。',
				help : '以庄闲的点数来进行判断结果。 0~4为小，5~9为大; 1、3、5、7、9为单，0、2、4、6、8为双; 1、2、3、5、7为质数，0、4、6、8、9为合数。', 
				how :'以庄闲的点数来进行判断结果。 0~4为小，5~9为大; 1、3、5、7、9为单，0、2、4、6、8为双; 1、2、3、5、7为质数，0、4、6、8、9为合数。',
				sample : '庄大',
				reward : '90123，即中庄大。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'庄' : {
								bcr_bank_big : '庄大',
								bcr_bank_small : '庄小',
								bcr_bank_single : '庄单',
								bcr_bank_double : '庄双',
								bcr_bank_prime : '庄质',
								bcr_bank_composite : '庄合',
						},
						'闲' : {
								bcr_play_big : '闲大',
								bcr_play_small : '闲小',
								bcr_play_single : '闲单',
								bcr_play_double : '闲双',
								bcr_play_prime : '闲质',
								bcr_play_composite : '闲合',
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
						'庄大' : '取得中',
						'庄小' : '取得中',
						'庄单' : '取得中',
						'庄双' : '取得中',
						'庄质' : '取得中',
						'庄合' : '取得中',
						'闲大' : '取得中',
						'闲小' : '取得中',
						'闲单' : '取得中',
						'闲双' : '取得中',
						'闲质' : '取得中',
						'闲合' : '取得中'
		        }
		},
		// 牛牛_牛牛
		// 134
		134 : {
			
				title : '开奖的五个数字中若有任意三个数字相加之和为0或10的倍数，其余下另两个数字之和的个位数作为对奖基准。',
				help : '开奖的五个数字中若有任意三个数字相加之和为0或10的倍数，其余下另两个数字之和的个位数作为对奖基准。', 
				how :'开奖的五个数字中若有任意三个数字相加之和为0或10的倍数，其余下另两个数字之和的个位数作为对奖基准。',
				sample : '牛牛',
				reward : '99219是10点（即牛牛），即中牛牛。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'牛牛' : {
								cow_1 : '牛一',
								cow_2 : '牛二',
								cow_3 : '牛三',
								cow_4 : '牛四',
								cow_5 : '牛五',
								cow_6 : '牛六',
								cow_7 : '牛七',
								cow_8 : '牛八',
								cow_9 : '牛九',
								cow_cow : '牛牛',
								cow_no : '没牛'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
						'牛一' : '取得中',
						'牛二' : '取得中',
						'牛三' : '取得中',
						'牛四' : '取得中',
						'牛五' : '取得中',
						'牛六' : '取得中',
						'牛七' : '取得中',
						'牛八' : '取得中',
						'牛九' : '取得中',
						'牛牛' : '取得中',
						'没牛' : '取得中'
		        }
		},
		// 牛牛_大小单双
		// 135
		135 : {
			
				title : '以开奖结果为依据。小:牛1~牛5，大:牛6~牛牛;单:牛1、3、5、7、9，双:牛2、4、6、8、牛牛，开奖结果为没牛，则投注牛大牛小皆为不中奖。',
				help : '以开奖结果为依据。小:牛1~牛5，大:牛6~牛牛;单:牛1、3、5、7、9，双:牛2、4、6、8、牛牛，开奖结果为没牛，则投注牛大牛小皆为不中奖。', 
				how :'以开奖结果为依据。小:牛1~牛5，大:牛6~牛牛;单:牛1、3、5、7、9，双:牛2、4、6、8、牛牛，开奖结果为没牛，则投注牛大牛小皆为不中奖。',
				sample : '牛大',
				reward : '02818即9点（牛9），即中牛大。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'大小单双' : {
								cow_big : '牛大',
								cow_small : '牛小',
								cow_single : '牛单',
								cow_double : '牛双'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
						'牛大' : '取得中',
						'牛小' : '取得中',
						'牛单' : '取得中',
						'牛双' : '取得中'
		        }
		},
		// 德州扑克
		// 136
		136 : {
			
				title : '德州扑克是以开奖五个号码为基准，按德州扑克牌面组合(豹子、四张、葫芦、顺子、三张、两对、一对、杂牌、五离)进行投注的一种玩法！',
				help : '德州扑克是以开奖五个号码为基准，按德州扑克牌面组合(豹子、四张、葫芦、顺子、三张、两对、一对、杂牌、五离)进行投注的一种玩法！', 
				how :'德州扑克是以开奖五个号码为基准，按德州扑克牌面组合(豹子、四张、葫芦、顺子、三张、两对、一对、杂牌、五离)进行投注的一种玩法！',
				sample : '葫芦',
				reward : ':77788，即中葫芦。' ,
				betType : 'sp_btn_line',
				betBtn : {
						'德州扑克' : {
								texas_leopard : '豹子',
								texas_four : '四张',
								texas_full_house : '葫芦',
								texas_straight : '顺子',
								texas_three : '三张',
								texas_two_pairs : '两对',
								texas_pair : '一对',
								texas_mix : '杂牌',
								texas_five : '五离'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
		        		'豹子' : '取得中', // 20000
		        		'四张' : '取得中', // 444.44444
		        		'葫芦' : '取得中', // 222.22222
		        		'顺子' : '取得中', // 166.66666
		        		'三张' : '取得中', // 27.77778
		        		'两对' : '取得中', // 18.51852
			        	'一对' : '取得中', // 3.96826
			        	'杂牌' : '取得中', // 6.94444
						'五离' : '取得中' // 833.33334
		        }
		},
		// 三公_左右和
		// 137
		137 : {
			
				title : '三公以开奖结果五个数字为基准，将左闲点数(前三位:万、千、百之和的个位数)与右闲点数(后三位:百、十、个)之和的个位数进行比对的一种玩法！比对的点数中0点为10点视为最大，9点为次大，1点为最小！',
				help : '三公以开奖结果五个数字为基准，将左闲点数(前三位:万、千、百之和的个位数)与右闲点数(后三位:百、十、个)之和的个位数进行比对的一种玩法！比对的点数中0点为10点视为最大，9点为次大，1点为最小！', 
				how :'三公以开奖结果五个数字为基准，将左闲点数(前三位:万、千、百之和的个位数)与右闲点数(后三位:百、十、个)之和的个位数进行比对的一种玩法！比对的点数中0点为10点视为最大，9点为次大，1点为最小！',
				sample : '左闲',
				reward : '4,4,0,6,8，即中左闲。',
				betType : 'sp_btn_line',
				betBtn : {
						'左右和' : {
								tp_left : '左闲',
								tp_right : '右闲',
								tp_tie : '和'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true,
		        odds : {
						'左闲' : '取得中',
						'右闲' : '取得中',
						'和' : '取得中'
		        }
		},
		// 三公_大小单双质合
		// 138
		138 : {
			
				title : '左闲点数/右闲点数的尾数：大小 0~4为小，5~9为大；单双 1、3、5、7、9为单，0、2、4、6、8为双；质合 1、2、3、5、7为质数，0、4、6、8、9为合数。<br/>',
				help : '左闲点数/右闲点数的尾数：大小 0~4为小，5~9为大；单双 1、3、5、7、9为单，0、2、4、6、8为双；质合 1、2、3、5、7为质数，0、4、6、8、9为合数。<br/>', 
				how :'左闲点数/右闲点数的尾数：大小 0~4为小，5~9为大；单双 1、3、5、7、9为单，0、2、4、6、8为双；质合 1、2、3、5、7为质数，0、4、6、8、9为合数。<br/>',
				sample : '左闲尾大',
				reward : '4,4,0,6,8，即中左闲尾大' ,
				betType : 'sp_btn_line',
				betBtn : {
						'左' : {
								tp_left_big : '左闲尾大',
								tp_left_small : '左闲尾小',
								tp_left_single : '左闲尾单',
								tp_left_double : '左闲尾双',
								tp_left_prime : '左闲尾质',
								tp_left_composite : '左闲尾合'
						},
						'右' : {
								tp_right_big : '右闲尾大',
								tp_right_small : '右闲尾小',
								tp_right_single : '右闲尾单',
								tp_right_double : '右闲尾双',
								tp_right_prime : '右闲尾质',
								tp_right_composite : '右闲尾合'
						}
				},
				longerBtn : true,
				posSelect : false,
				percentSelect : true
		}
};
	
